{
    "E0": {
        "rightistId": "E0",
        "contributorId": "",
        "lastUpdatedAt": "2022-07-26T18:18:57",
        "profileImageId": "",
        "imageId": [],
        "source": "original",
        "status": "Dead",
        "initial": "E",
        "firstName": "He",
        "lastName": "En",
        "gender": "",
        "birthYear": 1927.0,
        "deathYear": 2002.0,
        "rightistYear": 0,
        "ethnicity": 0,
        "birthplace": "",
        "education": "",
        "job": "Lecturer",
        "detailJob": "Lecturer",
        "workplace": "Inner Mongolia Eastern District ",
        "reference": "Excerpt from Ye Zhenhua: 'To Wuyi Sanxin 2017.4.14'",
        "description": "E En he (1927-2002), Dauer, formerly known as Guo Guide. Head of Inner Mongolia Eastern District Lecturer\n",
        "events": [
            {"startYear": 1958.0, "endYear": 0, "event": "the right was formed because of ethnicity."},
            {"startYear": 1979.0, "endYear": 0, "event": "corrected. Former vice-chancellor of the Communist Party School, chairman of the Communist Party of China's Inner Mongolia District Committee lecturer and deputy head of the lecturer delegation of the Communist Party"},
            {"startYear": 1988.0, "endYear": 0, "event": "leave."},
            {"startYear": 2002.0, "endYear": 0, "event": "he died from stomach cancer. Brother Guo Xingde graduated from the Mengzang overseas Chinese class at Nanjing Political Science School. In 1943, Ren Dewang Mengjiang Government Zhangjiakou Special City General Affairs Director, before Japan's defeat, was reassigned to Major General Zhang Bei Security Department. He assisted the Sumon Red Army and the Eighth Route Army to take over Zhangjiakou before being placed under house arrest In 1946, he joined the Northeast Military University, participated in the revolution, worked in Xilin Gol League government as chief of civil affairs, head of Cavalry 15th division hoe rape section, 1948 for Kuomintang crime (defamation, he never joined the Kuomintang), was arrested in 1951 or 1952, with no details and the whereabouts of the bones are unknown."}
        ],
        "memoirs": [],
        "workplaceCombined": "Lecturer at Inner Mongolia Eastern District ",
        "fullName": "En He"
    },
    "E1": {
        "rightistId": "E1",
        "contributorId": "",
        "lastUpdatedAt": "2022-07-26T18:18:57",
        "profileImageId": "",
        "imageId": [],
        "source": "original",
        "status": "Unknown",
        "initial": "E",
        "firstName": "Zhenyu",
        "lastName": "En",
        "gender": "",
        "birthYear": 0,
        "deathYear": 0,
        "rightistYear": 0,
        "ethnicity": 0,
        "birthplace": "",
        "education": "",
        "job": "",
        "detailJob": "",
        "workplace": "",
        "reference": "Excerpt from the Office of the Communist Party of China Jilin Provincial Committee: 'List of right-wing elements from all walks of life in Jilin Province 1958'",
        "description": "E En zhenyu\n",
        "events": [],
        "memoirs": [],
        "workplaceCombined": "",
        "fullName": "En Zhenyu"
    },
    "E2": {
        "rightistId": "E2",
        "contributorId": "",
        "lastUpdatedAt": "2022-07-26T18:18:57",
        "profileImageId": "",
        "imageId": [],
        "source": "original",
        "status": "Dead",
        "initial": "E",
        "firstName": "Erduntegusi",
        "lastName": "E",
        "gender": "male",
        "birthYear": 1921.0,
        "deathYear": 1990.0,
        "rightistYear": 1957.0,
        "ethnicity": 0,
        "birthplace": " Inner Mongolia Zhuo Sotumong Karachin Chinese flag Malatu Ao Bao Ali",
        "education": "",
        "job": "Translator",
        "detailJob": "Translator",
        "workplace": "the Inner Mongolia Autonomous Region Government Office",
        "reference": "Excerpt from Jin Tang: Erdun Tegus 2014/2/21\n",
        "description": "E E erduntegusi (1921-1990), male, Mongolian, Han name Zhang Deyin, small name Tegshidv, born in Inner Mongolia Zhuo Sotumong Karachin Chinese flag Malatu Ao Bao Ali, translation of the Inner Mongolia Autonomous Region Government Office\n",
        "events": [
            {"startYear": 1928.0, "endYear": 0, "event": "at the age of 8, Sounemu Salajid (Lama from Beijing Yonghegong, proficient in Meng, Han, full, Tibetan, etc.), as a teacher, learn Mont Han Manwen's 'Triad Notes', 'Three Words', 'Famous Xian Set', and so on. One year later, you can speak 'plum blossom two times', 'prodicites' Ode, 'One Floor', 'Weeping Red Pavilion', 'Ji Gong Biography', 'Three Kingdoms' ', 'Gods' and other stories."},
            {"startYear": 1929.0, "endYear": 0, "event": "Bai Zhao Peng learn Chinese as a teacher, learn 'university', 'mediocre', 'theory', etc., learn to write couplets, give red-and-white happy notes."},
            {"startYear": 1930.0, "endYear": 0, "event": "in Karachin Zhongqi public first primary school study."},
            {"startYear": 1933.0, "endYear": 0, "event": "Japanese imperialism seized the Karachin flag, schools were forced to suspend classes for nearly two years, and principal Bao Qingyuan resigned home."},
            {"startYear": 1935.0, "endYear": 0, "event": "the school was reinstated. Due to hard work, quality and excellent quality, he was able to give lectures to students in the first and second grades."},
            {"startYear": 1937.0, "endYear": 0, "event": "he was admitted to Wang Ye Temple Hing An College and began his career in poetry and literature."},
            {"startYear": 1940.0, "endYear": 0, "event": "one night, several Karachin classmates, including Sanarabatu, resisted and beaten up their previous grade Japanese students."},
            {"startYear": 1941.0, "endYear": 0, "event": "the debut 'Spring Wind' was published in the 'Green Flag' newspaper. It also published novels, prose and 'spring breath', 'before the market', 'spring', 'spring', 'spring flowers', 'spring flowers', 'spring party', 'spring party', 'spring night' and other poems. Graduated from Koon College and admitted to Tokyo College of Higher Education in Japan."},
            {"startYear": 1942.0, "endYear": 0, "event": "still works in an exotic country. He published novels, essays, 'spring morning', 'spring morning', 'spring lake' and other poems in the 'Qingqi' newspaper. He also translated 'Causes of a Little Girl's Death' by his friend Sanarabatu into Mongol."},
            {"startYear": 1942.0, "endYear": 0, "event": "published a short discussion on 'My Idea' in the Qingqi newspaper. Twelve episodes, four acts and six Mongolian historical opera 'Hunghorzhula' were published in Daqingqi newspaper. Mongolian intellectuals from Changchun Jianguo University and Xing'an College took it to stage and performed at Xingmengao (middle school), school in Zhangjiakou."},
            {"startYear": 1943.0, "endYear": 0, "event": "articles were published in the magazine 'Yin Yin' (Ulan Barges), 'The Death of Teacher Hexig', 'Contemporary Youth' and the novel 'Go' in Daqing Flag. In the school journal, Xingan Ridge published short prose 'Mongolian Youth', 'Flea' in Japanese, 'For Peers', 'In the village of Iyaka' and other essays. After reading these articles, Sai Chunga, who studied at the University of Tokyo, Japan, became friends. Novels, essays and poems of 'Two Generations', 'Military People in the Frontier', 'Forbidden Mongolian Youth' have been published continuously in newspapers such as 'Green Flag', 'Daqing Flag', 'Mongolian Newspaper', 'Mongolian Revival News' and other newspapers."},
            {"startYear": 1943.0, "endYear": 0, "event": "graduated from Japan, and taught Mongolian language, Japanese and music at Jongzheng School of Chosotou Karachin right banner. At the end of the year was transferred to Karachin Zuoqi Yuzheng Girls' High School"},
            {"startYear": 1944.0, "endYear": 0, "event": "went to Zhangjiakou, Zhangjiakou was the location of the 'Mongolian government' established by Demu Chukdongrupu (Dewang). The reason to go to Zhangjiakou was: 'One is to get rid of Japanese control and find a place with democracy and freedom. The second is that my age is pseudo-full, so I have the idea of evasion.' Working in Zhangjiakou Xingmeng Committee for five months. After that, go to Hohhot, by classmates Baoyin Ao Luge introduced, to Xilin Gol Union Sunit right flag junior school teaching. Created the Sunny issue. This school is a preparatory school for the training of officers."},
            {"startYear": 1945.0, "endYear": 0, "event": "the Sumon coalition troops entered Inner Mongolia, and Japan defeated. Military school students shot and killed three Japanese, including Shinenaka, and the principal of Mengenakura. He was appointed secretary of the General Assembly for the establishment of the Interim Government of the Inner Mongolia People's Republic and elected as a representative to Dongmongung. During the period, he read works such as the Communist Party Declaration, 'Some Issues of Leninism', 'History of the Soviet Bolshevik Party' and the revolutionary literature of the Mongolian period. These writings represent a fundamental change in the view of the world and the outlook of life, forming the socialist proletarian position and view. Inner Mongolia Autonomous Movement Federation was established in Zhangjiakou. There are differences and controversy with Ulaanf on the programme of the Federation."},
            {"startYear": 1946.0, "endYear": 0, "event": "in Zhangjiakou as editor of 'Inner Mongolia Weekly', also taught at Inner Mongolia Military University. As Fu Zuoyi Ministry attacked Zhangjiakou, Inner Mongolia Federation of Autonomous Movement retreated to the Xilin Gol League Manitu Temple. In Xilinhot, the administrative committee of Zahar and Xilin Gol two alliances was the acting director of the propaganda and education department."},
            {"startYear": 1947.0, "endYear": 0, "event": "the printing press and other equipment that went to the Chandu Temple were robbed by bandits, after suspicion and excuse by others, and left Xilinhot and went to Ulanhot to do translation editing work at the Inner Mongolia newspaper. During the period, disagreement with the president brave husband (Batu), was falsely accused and imprisoned for a year and a half. After students Zhang Buyun circled, was able to release and resume work."},
            {"startYear": 1948.0, "endYear": 1950.0, "event": "edited textbooks at the editorial office of the Inner Mongolia Department of Culture and Education, translated Zhao Shuli's novel, 'Marriage in the Little Second Black' and published in Inner Mongolia Weekly."},
            {"startYear": 1952.0, "endYear": 0, "event": "teaching in Inner Mongolia Public Security School."},
            {"startYear": 1956.0, "endYear": 0, "event": "in Inner Mongolia Autonomous Region Government Office did translation work."},
            {"startYear": 1957.0, "endYear": 0, "event": "after reading Rongxiang's 'Proposals to Young People', he said a sentence different from Rongxiang's work, and was beaten as right-wing elements."},
            {"startYear": 1958.0, "endYear": 0, "event": "criticized by the Inner Mongolia Autonomous Region Government Office, the loss of work was sent to the West Sunite Flag Baiyin Wendul iron ore labor reform."},
            {"startYear": 1960.0, "endYear": 0, "event": "after being released from the labor force, returned to his hometown of Ningcheng County Dacheng Zi."},
            {"startYear": 1962.0, "endYear": 0, "event": "went to Bayannur Union Union Flag Wengen Commune Alatan and Masters Team niece family, engaged in pastoral work for seven years. During this period, the writing of the long novel 'Three Houses of the North of Poplars' began, the original was burned in the Cultural Revolution (more than 70 pages)."},
            {"startYear": 1966.0, "endYear": 1976.0, "event": "in the middle of the Cultural Revolution, he was 'Hohhot Third Command' and held. The refusal to admit was a crime such as Mongolia, the Soviet Union, Japanese agents and 'national separatists', and responded justly. Written in the evidentiary material, there is no lie."},
            {"startYear": 1971.0, "endYear": 0, "event": "in order to care for the elderly mother, from the Urat, the joint flag returned to her hometown of Oyutthaya as productive labour."},
            {"startYear": 1975.0, "endYear": 0, "event": "the mother died."},
            {"startYear": 1976.0, "endYear": 0, "event": "he went to Heilongjiang to find a job."},
            {"startYear": 1977.0, "endYear": 0, "event": "returning from Heilongjiang Province to their hometown, the rehabilitation of victims of the 'left-leaning route' movement has begun."},
            {"startYear": 1978.0, "endYear": 0, "event": "came to Hohhot, asking for the implementation of the policy."},
            {"startYear": 1979.0, "endYear": 0, "event": "the General Office of the Reform Commission of the Inner Mongolia Autonomous Region issued \\\\([0-9]{4}-\\\\), document No. 6, to rehabilitate the grievances, restore honor, and arrange to work at the Mongolian Institute of Inner Mongolia Academy of Social Sciences."},
            {"startYear": 1980.0, "endYear": 0, "event": "he was transferred to Inner Mongolia Mongolian College to teach Japanese language classes. During this period, the Mongolian Interpretation Japanese Textbook was prepared in collaboration with Uentai and participated in the finalization of the Mongolian Vocabulary Interpretation Dictionary. Cooperated with Asaratu to translate the first volume of 'History of Dosan Mongolia' and published long articles commenting on the novel 'Hope', 'One Floor', 'Weeping Red Pavilion' and so on. When talking about the road of life, I said with infinite emotion: 'Since I only say a sentence different from Rongxiang's work, for this, I have suffered twenty years of unmistakable grievances and suffered human suffering, to whom?Twenty years! My golden age of twenty years! I was only 38 years old when I was beaten as a 'right-wing', when I started a life business, contributing to the people and realizing my ideal, but this wonderful time was wasted in vain. What a pity! Regret!' 'Think this road is right, after embarking on without retrospect, walking, and there have been many branch paths, I don't know where, I don't know how to do...' 'The road of life is more difficult, more sinister ah, right road just walked, but into the old world. But I'm still not discouraged, regardless of any difficult and dangerous obstacles, I will go forward!' 'I think happiness is to be a person who can create a beneficial cause for the future and survival of his country and his own nation, and can fully see the fruitful results of this cause is the true happiness of life.'"},
            {"startYear": 1983.0, "endYear": 0, "event": "from Hohhot, Mowuda Mengcheng County Mongolian middle school was instructed by Mongolian and Japanese teachers. The drama 'The Demise of the Hugchu Shaman' and 'On the Promotion of Mongolian Language', 'How to Improve the Teaching of Mongolian Language' and 'On the Customs of Mongolian Language Teaching' were prepared and published at the annual meetings of the Education Institute at the regional and municipal levels and the Mongolian Language Research Institute."},
            {"startYear": 1986.0, "endYear": 0, "event": "the Office of Implementation Policy of the Inner Mongolia Autonomous Region Public Security Department issued document No. 43 \\\\([0-9]{4}-\\\\), which completely repudiated all past cases of wrongs and mistakes in E erduntegusi and implemented the policy. After leaving, he also published 'How to accurately write names and place names when translating books of Mongolian history into Mongolian language', 'On the reform of the Lama teachings', 'Haolaibaohua (Mystery of Mongolia)' (three volumes of poetry), and 'Exploration of the human flow of Karaqin Mongolian'. The Japanese 'History of Doosan Mongolia' was prepared to be translated into the Chinese 'Annotated History of Doosan Mongolia', and published 'Exploration of the Village Capital' in Inner Mongolia Social Sciences (1989, Second Issue). The question of re-evaluation of the 'national hero' Gardan Boshoktu; on the restoration of the name of the Chinese flag of Karakin and left and right two flags on equal administration and establishment; proposals on the simultaneous teaching of Han children in Mongolian populated areas from Hanmong, etc., to strengthen national unity and maintain society Will make a positive contribution steadily."},
            {"startYear": 1990.0, "endYear": 0, "event": "on a business trip in Chengde City, Hebei Province, died in a car accident, 70 years old. Knowing Meng, Han, full, Japanese and Russian five languages, his life was written as 'my past 60 years', divided into 'Youth Life', 'In Xingan College and Study Abroad in Japan', 'The First Step to Society', 'In Ulaanbaatar Period', 'Inner Mongolia Autonomous Movement' The Rally Period, 'War of Liberation', 'Twenty Years of Right Life', 'More Than Journey' Partial, about ten thousand words."},
            {"startYear": 1929.0, "endYear": 0, "event": "Karakin Zhongqi public primary school was formally established in the Wangfu compound. The school was established under the strong advocacy of Merlin Bao Qingyuan old Mr. Bai Qifeng, Yili Chun, Ning Wanguo and other Zhishi-Xian Da and supported by Chinese flag Wang Hanrozab. Eerdun Tegus was 10 years old \\\\([0-9]{4}-\\\\), enrolled in the school. In 1933, Japanese imperialism invaded the Karachin flag, due to the social order and the situation forced, the school was forced to suspend classes for nearly two years, and principal Bao Qingyuan resigned home. In 1935, the school was restored, Kim Qimilling as principal, Chen Qingyun (Qimod Su Rong, graduated from Ulaanbaatar Youth League School, is a member of the Inner Mongolia People's Revolutionary Party under the leadership of Communist International), as a teacher of Mongolian Wen. Erdun Tegus was able to give lectures to first and second graders during school, and graduated with honors in December 1936 from the cradle of ethnic education."},
            {"startYear": 1942.0, "endYear": 0, "event": "Erdentegus was in an exotic country, but still works. In the 'Qingqi' newspaper, the 'Night', 'Golden Autumn State' and other novels, essays and poems of Spring Qingming, Spring Morning, Spring Lake, etc. In addition, his friend Sanarabatu's Chinese work 'Causes of a Little Girl's Death' was translated into Mongol. On August 8, 1942, he published a short discussion on 'My Idea' in the Green Flag newspaper. In the same year, Twelve episodes, four acts and six Mongolian historical opera 'Hunghorzhula' were published in Daqingqi newspaper. Mongolian intellectuals from Changchun Pseudo-Man University and Xing'an College had put it on stage and performed at Xingmengao (middle school), school in Zhangjiakou."},
            {"startYear": 1943.0, "endYear": 0, "event": "Erdun Tegus published articles such as 'The King Kebu and the Death of Teacher Hexig' and 'Contemporary Youth' in the magazine 'In Yin' (Ulan Barges), and also published the novel 'Go' in the Daqing Flag."},
            {"startYear": 1983.0, "endYear": 0, "event": "E erduntegusi transferred from Hohhot to his hometown, Zhaowuda Mengcheng County Mongolian Middle School to teach, doing the mentoring of Mongolian and Japanese teachers at the school. During this period, the drama 'The Demise of Hugchu Shaman' and papers on the promotion of the Mongolian language, on how to improve the teaching of Mongolian languages, and on customs clearance in Mongolian language teaching were also prepared and published at the annual meetings of the Education Institute at the regional and municipal levels and the Mongolian Language Research Institute."}
        ],
        "memoirs": [
            {"memoirTitle": "", "memoirAuthor": "", "memoirContent": "【Attached】Jin Tang: 'Erdun Tegus 2014/2/21'\\nE erduntegusi (1921-1990), Mongolian, familiar with Meng, Han, full, Japanese, Russian five languages, was the first editor of Inner Mongolia newspaper before the founding of the country, is my county, modern translation, literature, poetry and other significant achievements of senior Mongolian intellectuals. \\nErdun Tegushan name Zhang Deyin, small name Tegshidv, was born on March 5, 1921 (Lunar New Year 26), in Inner Mongolia Zhuo Sotu Meng Karakin Zhongqi (Jinningcheng County), Malato (Jinningzi Town), Ao Bao Ali. \\nIn his life, Mr. Erdun Tegus recorded his life in words 'My Past 60 Years' in Monghan. Life is divided into 'Youth Life', 'Studying at Xingan College and Japan', 'The First Step to Society', 'In Ulaanbaatar Period', 'Inner Mongolia Federation of Autonomous Movement', 'Period of Liberation War', 'Twenty Years of 'Righties' Life', 'More Than Journey' Partial, about ten thousand words. \\nI. Juvenile life (1921-1936)\\nE erduntegusi from the young family is poor, father Baoyin Nemov diligent, relying on to the rich man Sedeng Qingqing to work to support their families. At the age of 8 E erduntegusi, Sounemu Sarajid (Lama from Beijing Yonghegong, proficient in Meng, Han, Full, Tibetan, etc.), as a teacher, learn Monhan Manwen's 'Triad Notes', 'Three Words', 'Celebrity Collection' and other books for about a year, can give a speech to people 'Plum Blossom II' Degrees, 'Son of the Fortune', 'One Floor', 'Weeping Red Pavilion', 'Ji Gong', 'Three Kingdoms', 'Fengshen' 'Perpetual' and other stories. \\nAt the age of nine \\\\([0-9]{4}-\\\\), Bai Zhao Peng to learn Chinese as a teacher, learn books such as 'University', 'Middle Agile', 'Theory', and learn to write couplets, give red-and-white happy notes. \\nIn 1929, Karakin Zhongqi public primary school was formally established in the Wangfu compound. The school was established under the strong advocacy of Merlin Bao Qingyuan old Mr. Bai Qifeng, Yili Chun, Ning Wanguo and other Zhishi-Xian Da and supported by Chinese flag Wang Hanrozab. Eerdun Tegus was 10 years old \\\\([0-9]{4}-\\\\), enrolled in the school. In 1933, Japanese imperialism invaded the Karachin flag, due to the social order and the situation forced, the school was forced to suspend classes for nearly two years, and principal Bao Qingyuan resigned home. In 1935, the school was restored, Kim Qimilling as principal, Chen Qingyun (Qimod Su Rong, graduated from Ulaanbaatar Youth League School, is a member of the Inner Mongolia People's Revolutionary Party under the leadership of Communist International), as a teacher of Mongolian Wen. Erdun Tegus was able to give lectures to first and second graders during school, and graduated with honors in December 1936 from the cradle of ethnic education. \\nII. Period of study in Koan College and Japan (1937-1942)\\nIn March 1937, Erdun Tegus was admitted to Wang Ye Temple (now Wulanhot), Xing'an College. This is a Mongolian supreme university established by the pseudo-Manchurian State in Dongmongung. \\nThe young Erdun Tegus began his career in poetry and literary creation because of his early qualifications, with deep literary skills. 1941, the debut 'Spring Wind' was published in the 'Green Flag' newspaper. In the year, he published novels, prose and 'spring breath', 'before the market', 'spring', 'spring water', 'spring', 'spring flowers', 'spring party', 'spring party', 'spring night' and other poems. \\nAnother important event in Erdun Tegus during his studies at Hung An College was the night in April 1940, when he led two classes in the fourth class with several Karaqin students, including Sanarabatu, resisted and beaten his previous grade Japanese students. The course of the matter is this: the school is five years, the first three years are 'lower grade' students, and the next two years are 'senior' students. And 'senior' students have 'privileges' to 'lower grade' students, such as beating and punishing. Erdon Tegus was dissatisfied with this 'privilege' phenomenon on campus and organized this campaign to fight with the Japanese. His opposition to the repressive idea of feudal hierarchy was linked to being taught by his upright father from an early age, but also to the progressive thinking and formal education he received in schools. He later wrote in the record: 'Under the education of two former Enlightenment Teachers (Golden Start Milling and Zimod Surong), more than 30 students in our class were influenced by them, had more progressive ideas and learned a lot of knowledge.' \\nAs a result of this incident, Sanarabatu was expelled from school and other 'bad elements' were punished, but the students' ambition to fight increased, close contacts were established with the students of Wang Ya Temple Middle School and military school students, preparing to form a 'Xingmeng Party' to fight. He read the Japanese book 'Young Up' with his friends who advocated the establishment of the 'Hing Meng Party' (the original book reads: 'When Emperor Hubeirei in the Yuan Dynasty, Mongolians came to Hakuda Bay to attack us. Although there was no victory, because the Mongolian nation was particularly brave, that spirit we young people must never forget.'), At the time, it was discovered by Japanese agents that the plan to set up the 'Hing Meng Party' was therefore undermined, and the party building activities could not be carried out. Despite the unsuccessful establishment of the 'Himmon Party', but due to its influence, Gowa (Dauzhnatib), and Erdentegus, who worked for the creation of the party, were persecuted during the 'Cultural Revolution'. \\nIn March 1941, Erdun Tegus graduated from Kyoan College and was admitted to the Tokyo College of Higher Education in Japan. \\nIn 1942, Erdentegus was in an exotic country, but still works. In the 'Qingqi' newspaper, the 'Night', 'Golden Autumn State' and other novels, essays and poems of Spring Qingming, Spring Morning, Spring Lake, etc. In addition, his friend Sanarabatu's Chinese work 'Causes of a Little Girl's Death' was translated into Mongol. On August 8, 1942, he published a short discussion on 'My Idea' in the Green Flag newspaper. In the same year, Twelve episodes, four acts and six Mongolian historical opera 'Hunghorzhula' were published in Daqingqi newspaper. Mongolian intellectuals from Changchun Pseudo-Man University and Xing'an College had put it on stage and performed at Xingmengao (middle school), school in Zhangjiakou. \\nIn 1943, Erdun Tegus published articles such as 'The King Kebu and the Death of Teacher Hexig' and 'Contemporary Youth' in the magazine 'In Yin' (Ulan Barges), and also published the novel 'Go' in the Daqing Flag. \\nAt the same time, short essays were published in the school journal 'Xingan Ridge', 'Young Mongolian', 'Flea', 'For Peers' and 'In the village of Iyaka'. At that time, Sai Chunga, who studied at the University of Tokyo in Japan, read these articles and shared information with Erdun Tegus as friends. \\nIn addition, novels, essays and poems of 'Two Generations', 'Military People in Frontiers' and 'Forbidden Mongolian Youth' have been published continuously in newspapers such as 'Green Flag', 'Daqing Flag', 'Mongolian Newspaper' and 'Mongolian Revival News'. \\nErdun Teguss loves the motherland and nation, his homeland and people, and his ideological feelings and moral feelings are extremely noble. His verses are filled with the power of life, with his dedication to the pursuit of good ideals. While studying in Koan College and Japan, he has achieved fruitful work in literature, ideological and political ideas matured. This time was the most precious golden period of his life. \\nIII. First steps towards society (1943-1944)\\nIn February 1943, Erdun Tegus graduated from Japan and taught at the Zongzheng School of Chosotou Karachin Right Flag. The school was founded by the guoshi 28 \\\\([0-9]{4}-\\\\), flag Wang Gon Sang Nolb, after Japan encroachment, changed the name of the school to Shojo National High School, the Japanese Takeda as president. Erdun Tegus teaches Mongolian language, Japanese, music, and any class director, and student life administrator. \\nSchool Japanese teacher Takenai speaks the contents of ten lessons in one lesson in the Japanese language course and requires students to recite all, otherwise they beat the students. After the students reflected this situation to teacher Erdentegus, he urged students to refuse to accept the teaching method in Takeuchi, and the school abolished the power to teach Japanese language classes in the first grade in Takeuchi. \\nAs a result of the Takeuchi incident, Erdun Tegus was transferred to Karachin Zuoqi Yuzheng Girls' High School to teach. At this time, Erdun Tegus, having realized that the Japanese wanted to harm him, went to Zhangjiakou the following year \\\\([0-9]{4}-\\\\). At that time, Zhangjiakou was the home of the 'Mongolian government' established by Demutchuk Donrup (Dewang). His reason for going to Zhangjiakou was as follows: 'First, he wanted to get rid of Japanese control and find a place where democracy and freedom exist. The second is that my age is pseudo-full, so I have the idea of evasion.' When Erdun Tegus went to Zhangjiakou for Zagala, who was editor of the Mongolian newspaper, and since Zagala had moved to the Xingmong Committee, he found the committee and worked there for five months. After that, went to Hohhot, by classmates Baoyin Ao Luge introduced, to Xilin Gol Union Sunit right flag junior school teaching. Since this school is a preparatory school for the training of officers, there is strict military training. The principal is Stedarima and Mengenkura. During the course of the University, Erdun Tegus created the Sunny Special Journal. \\nIV. During the Ulaanbaatar period \\\\([0-9]{4}-\\\\)\\nIn August 1945, the Sumon coalition troops entered Inner Mongolia, and Japanese imperialism defeated. At this time, the school's military instructor, Japanese Shinenaka and principal Mengenkura led the students to flee south to the Bishirretu Temple. At this time, the students of the conscious military school shot and killed three Japanese people such as Shinenaka and Mengenakura. On the way back to school met Sumon troops, and returned to the school after handing over their arms. But Sumon army officer Namus came to let Erdun Tegusdang guide to Zhang Bei. After returning to school from Zhang North, Erdun Tegus took another part of the students scattered in the business capital back to school in Soviet military vehicles with Oltgen. Subsequently, Erden Tegus contacted Mongolian Colonel Robacang and sent more than 150 students to Ulaanbaatar for study. \\nAfter the arrival of the Mongolian Red Army of the Soviet Union, the Simon Autonomous Government, Tegsi Boyin, Mugdanbao, Guingalang, Jirga and the Mongolian Army Uliki Ochir, Damulin Su Rong together with young intellectuals Burensaiyin, Dugorzab, Huzhabilig, Qinggratu, Ulyginalen, to prepare Established the 'Interim Government of Inner Mongolia People's Republic', at the same time, Burensaiyin also prepared Establishment of the Inner Mongolia People's Revolutionary Al-Shabaab Party. These two events were supported by Colonel Robacan and Zamuyan. At this time, Erdun Tegus was hired as the secretary of the founding government assembly and was elected as a delegate to East Mont to Ulaanbaatar with the Sumon Red Army detour. At the time of their arrival, representatives of Mugdanbao, Ji Rigaleng, Uligi Aochir, Burensaiyin, Sunumu Yongrong, Baiyun Hanghang, Erder Mutu and other representatives were there. Since Dongmong representatives will also come to Ulaanbaatar, so Erdun Tegus and Guan Buzab have no need to go to Dongmong anymore. At that time, the KMT government was about to recognize Mongolia's independence, so Lei Fachang, Deputy Foreign Minister of the KMT, also arrived in Ulaanbaatar, so Simon's representatives returned without success. During his stay in the Mongolian People's Republic, Erdentegus read Marxist-Leninist classics such as the Communist Declaration, Certain Issues of Leninism, History of the Soviet Bolshevik Party, and the Mongolian Revolutionary Literature of the New Era. These writings have made a fundamental change in his view of the world and life, forming a scientific socialist proletarian position and view. \\nAt the end of October 1945, Erdentegus returned with other representatives to the West Sunit flag. At this time, the 'Interim Government of the Inner Mongolia Republic' has been set up at the Wendur Temple. Later, Yunze (Ulaanf), Kuibi, Kliget and others came to the Wendur Temple. After re-election, Ulaanf was elected chairman and moved the interim government to Zhang Bei. In early November 1945, E erduntegusi, Burensaiyin, Ulijinajen and other people came to Zhangjiakou Jiefang Hotel to meet with Ulanfu. At that time, Ulaanf was preparing to set up the Federation of Inner Mongolia Autonomous Movement. On November 26, 1945, Inner Mongolia autonomous movement Federation was formally established in Zhangjiakou Yuanlaizhuang. On issues such as the Federation's agenda and Ulaanf were divided and controversial, he later wrote the situation in the autobiography. \\nThe period of the Federation of Autonomous Movements in Inner Mongolia \\\\([0-9]{4}-\\\\)\\nIn January 1946, Erdun Tegus was editor of Inner Mongolia Weekly in Zhangjiakou. He also taught at the Inner Mongolia Military University from March to October 1946. Later, he was re-editor of Inner Mongolia Weekly. \\nIn September 1946, because the Kuomintang Fu Zuoyi Department attacked Zhangjiakou, the Federation of Inner Mongolia Autonomous Movement withdrew to the Xilin Gol League Manitu Temple. At that time, in Xilinhot, Zahar and Xilin Gol two administrative committees have been set up, and Erdun Tegus served as acting director of the propaganda and education department. \\nVI. War of liberation and early nation-building (1947-1957)\\nIn the first month of 1947, Erdun Gusi came from Manitu Temple to Xilinhot. Soon, it was heard that his wife dark clouds whose mu grid was coming to Xilinhot, had arrived at the seat of the Abaganar flag government. Coinciding with Erdun Tegus went to Chamdo Temple to buy a printing machine, passed the Abaganar flag, and then took his wife dark clouds with its wooden grid, together to the Chamdo temple, but on the way back to encounter bandits, bought printing machines and other equipment were snatched. E erduntegusi was therefore mistrust and deputed by others, so he left Xilinhot and went to Ulanhot to do translation editing work at the Inner Mongolia newspaper. During the period, Erdun Tegus proposed to change the three-day edition of the newspaper into a daily newspaper, and transfer the right of review to the editor and other suggestions, and then disagreed with the president's brave husband (Monte Batu), who was falsely accused and spent a year and a half of prison life. Later, by his student Zhang Buyun from the middle, he was able to release and resume work. \\nFrom 1948 to 1950, E erduntegusi worked in the editorial office of the Inner Mongolia Department of Culture and Education. During this period, Zhao Shuli's novel 'Little Two Black Marriage' was translated in poems and published in Inner Mongolia Weekly. Teaching in Inner Mongolia Public Security School in 1952. In 1956, in Inner Mongolia Autonomous Region Government Office did translation work. \\nBetween 1952 and 1957, Erdentegus, despite two moves, was under pressure on thought and work, but never intermittent literary creation. Poems, prose and fairy tales, including 'Rain Night', 'Journey', 'Story of a Handful of Earth', 'Ants and Cricket' have been published in newspapers such as Inner Mongolia Literature, Flower Buds, and Inner Mongolia Daily. \\nDuring that decade, Erdentgus was subjected to unfortunate incidents such as bandits looting and imprisonment. \\nVII. Twenty Years of 'Right' Life (1958-1978)\\nAfter reading Rongxiang's work, 'Proposals to Young People', Mr. Erdun Tegus was labelled as 'right' because he said a different view from Rongxiang's work. In April 1958, he was criticized by the Inner Mongolia Autonomous Region Government Office, lost jobs and reformed by labour. May 1958 went to the West Sunit flag white tone Windul iron ore labor transformation. In the autumn of 1960, after being released from the labor force, returned to her hometown of Ningcheng County Dachengzi. In 1962, he went to the Alatan Commune of the Union Flag Wengen in Bayannur Union Urad and the Masters Brigade niece home for seven years. \\nDuring this period, Erdun Tegus began writing the long novel 'Three Houses of the North of Poplars', where the manuscript was burned (over 70 pages), due to the 'Cultural Revolution'. \\nHe also clearly wrote in his autobiography: 'In the early days of the Cultural Revolution, I spoke to and had a fierce controversy with those people because of the far-left movement to cut women's long braids.' \\nIn the middle of the Cultural Revolution, the 'Hohhot Third Command' (then the 'villain' organization), pulled Erdun Tegus to Hohhot Art School by a joint flag in Urat, forcing him to write written material of the school's principal Baoyin Dalai 'Mongolian special', and then transferred him to the Inner Mongolia Mongolian College of Literature School ban. At that time, Gova (Dauzhnatib), Hugjiv, Qindamuni and Todi were also detained there. One day, when Neida's rebellists came to Mongolia to force Erdentegus to admit that he was Mongolia, the Soviet Union, Japanese agents, and 'national separatists' and criticized them, he did not accept the crime of 'nothing to do', and responded rightly. During the school's confinement period of more than two months, there was no false statement to the person who had sought him to write evidence. \\nIn the late Cultural Revolution \\\\([0-9]{4}-\\\\), in order to care for an elderly mother, Erdun Tegus returned to his hometown of Ayutthaya as productive labour from the middle of Urat, and his mother died in 1975. In 1976, he went to Heilongjiang to find a job. He returned from Heilongjiang Province in 1977 to his hometown and is experiencing the 'left-leaning route' movement of victims has begun, so he came to Hohhot in 1978 to demand the implementation of the policy. Therefore, the General Office of the Reform Commission of Inner Mongolia Autonomous Region issued \\\\([0-9]{4}-\\\\), document No. 6, reinstating the grievances of Comrade E erduntegusi, and arranged to work at the Mongolian Institute of Inner Mongolia Academy of Social Sciences for nearly a year, and then transferred to Inner Mongolia Mongolian College to teach Japanese language classes. \\nDuring this period, Erdun Tegus collaborated with Uentai on the preparation of the Mongolian Interpretation Japanese Textbook, and has since participated in the finalization of the Mongolian Vocabulary Interpretation Dictionary for almost six months. Cooperated with Asaratu to translate the first volume of 'History of Dosan Mongolia' and published a long article commenting on the novel 'Hope', 'One Floor', 'Weeping Red Pavilion' and so on. \\nLater, Erdun Tegus remorse over his grievance that he was called 'right' wrote: 'Since I only said a sentence different from Rongxiang's work, for that reason, I suffered two decades of unmistakable wrongs and suffered human suffering, to whom?Twenty years! My golden age of twenty years! I was only 38 years old when I was beaten as a 'right-wing', when I started a life business, contributing to the people and realizing my ideal, but this wonderful time was wasted in vain. What a pity! Regret!' \\nVIII. Beyond the journey (1979-1990)\\nWhen talking about the road of life, Erdun Tegus has said with infinite emotion: 'think this road is right, and after embarking on without retrospect, walking, and there have been many branch paths, do not know where, I don't know how to do...' 'The road to life is more difficult, more sinister ah, 'right' road has just been completed, but into the old world again. But I'm still not discouraged, regardless of any difficult and dangerous obstacles, I will go forward!' \\nSpeaking of happiness in life, he said: 'I think happiness is to be a person who can create a beneficial cause for the future and survival of his own country and his own nation, and to fully see the fruitful results of this cause is the true happiness of life.' \\nIn 1983, E erduntegusi transferred from Hohhot to his hometown, Zhaowuda Mengcheng County Mongolian Middle School to teach, doing the mentoring of Mongolian and Japanese teachers at the school. During this period, the drama 'The Demise of Hugchu Shaman' and papers on the promotion of the Mongolian language, on how to improve the teaching of Mongolian languages, and on customs clearance in Mongolian language teaching were also prepared and published at the annual meetings of the Education Institute at the regional and municipal levels and the Mongolian Language Research Institute. \\nAfter 1983, Erdun Tegus has published poems 'Scenery of Ayutthaya' \\\\([0-9]{4}-\\\\), 'The Manqing Government's Policy towards the Mongolian Nationalities' (1986·8), 'Manners and customs of the Mongolian people in the middle flag of the Karakin' (1987·4), 'The Good Matter' of the Lama Temple in the Karachin region (1988·5)), Chen Qingyun (1988·6), The History of Mongolian Education in the Dachengzi Region (1988·7), the 'Four Great Heroes' (Swing, Skipping, Kicking, Wrestling), Sports (1988·8), and other 36 academic papers and precious historical materials were published in the Zhaowuda newspaper, Chifeng Daily, 'Ningcheng County Literature and History Materials' series. \\nOn December 1, 1986, the Office of Implementation Policy of the Inner Mongolia Autonomous Region Public Security Department issued \\\\([0-9]{4}-\\\\), document No. 43, which completely repudiated all past wrongs and mistakes of Comrade E erduntegusi and put into effect the policy. Shortly after that time he left. After his departure, he also published academic papers on 'How to accurately write names and place names when translating books of Mongolian history into Mongolian language', 'On the reform of the Lama teachings', 'Haolaibaohua (Mystery of Mongolia)' (three volumes of poetry), and 'Exploration of the human flow in Mongolia'. The Japanese 'History of Doosan Mongolia' was prepared to be translated into Chinese 'Annotated (History of Doosan Mongolia)' and published the article 'On the Village Capital' in Inner Mongolia Social Sciences (Second Issue of 1989). These works are representative works of his old age and reflect the noble realm of the artistic and intellectual knowledge of Mr. Erdentegus in the study of Mongolian history and literature. \\nIn addition, in his later years, he also reflected to the relevant departments about the correct evaluation of the CPC Central Committee in the Yan'an period to the early days of the Cultural Revolution (1936-1966), which was recognized as the 'national hero'; on the restoration of the name of the Karachin middle flag and the right two flags of Karachin and the right two flags of the same administration and construction Problems of the system; about Han children in Mongolian populated areas from a young Hanmong Suggestions for simultaneous teaching of two languages and other issues. It has made a positive contribution to the strengthening of national unity and the maintenance of social stability. \\nOn 29 July 1990, Mr. E erduntegusi was killed when he was 70 years old when he suffered a car accident in Chengde City, Hebei Province. \\nAlthough Mr. Erdon Tegus passed away from the world, his spirit persists forever. Humane people remember him deeply, remembering the famous poet in the history of modern Mongolian literature in various ways, remembering the pioneer of modern Mongolian poetry and modern literature. In recent years, Cao Du Batel of the Chinese Academy of Social Sciences, Xilin Barter of Inner Mongolia People's Publishing House, Se Saiyin Bayar of Chifeng Municipal Committee, Namjira of Ningcheng County People's Congress, Erdun Batel of Ningcheng County Government Translation Office, Uzhtu Bayar of Ningcheng County Committee for Ethnic Affairs, Ningcheng County Ethnic Affairs Committee County deputy food company Jintang, Ningcheng County Small Chengzi Town Government Ma Yongfeng, Tianyi Mengzhong Tacang, Dacheng Many comrades such as Qi Fengge have collected, collated or translated, published the works of Mr. Erdon Tegus and his outstanding achievements and contributions in revitalizing the national culture in different ways. \\nErdun Tegus loves the nation, loves the motherland, his bumpy and pursuit, ordinary and great life, always inspire millions of people to complete his unfinished business, his spiritual wealth for the future is precious, his name forever history!"}
        ],
        "workplaceCombined": "Translator at the Inner Mongolia Autonomous Region Government Office",
        "fullName": "E Erduntegusi"
    },
    "E3": {
        "rightistId": "E3",
        "contributorId": "",
        "lastUpdatedAt": "2022-07-26T18:18:57",
        "profileImageId": "",
        "imageId": [],
        "source": "original",
        "status": "Unknown",
        "initial": "E",
        "firstName": "E",
        "lastName": "guilin",
        "gender": "",
        "birthYear": 0,
        "deathYear": 0,
        "rightistYear": 0,
        "ethnicity": 0,
        "birthplace": "",
        "education": "",
        "job": "",
        "detailJob": "",
        "workplace": "",
        "reference": "E guilinxcerpt from the Office of the Communist Party of China Jilin Provincial Committee: 'List of right-wing elements from all walks of life in Jilin Province 1958'",
        "description": "E guilin E guilin Guilin\n",
        "events": [],
        "memoirs": [],
        "workplaceCombined": "",
        "fullName": "guilin E"
    },
    "E4": {
        "rightistId": "E4",
        "contributorId": "",
        "lastUpdatedAt": "2022-07-26T18:18:57",
        "profileImageId": "",
        "imageId": [],
        "source": "original",
        "status": "Unknown",
        "initial": "E",
        "firstName": "Meishanheshang",
        "lastName": "E",
        "gender": "",
        "birthYear": 0,
        "deathYear": 0,
        "rightistYear": 1957.0,
        "ethnicity": 0,
        "birthplace": "",
        "education": "",
        "job": "Student",
        "detailJob": "Student",
        "workplace": "Department of History, Yunnan University",
        "reference": "Excerpt from Yunnan University Committee of the Communist Party of China: 'Right Word and Deeds' (next episode)\n",
        "description": "E E meishanheshang Monk, pseudonym, 1st grade student, Department of History, Yunnan University\n",
        "events": [
            {"startYear": 1957.0, "endYear": 0, "event": "he was beaten as right-wing elements."}
        ],
        "memoirs": [
            {"memoirTitle": "", "memoirAuthor": "", "memoirContent": "【Attached】First Year of History Department E meishanheshang Monk: 'Quan Sewen'\\n(Committee of Yunnan University of the Communist Party of China: 'Emei Mountain Monk' dressed up for charity and went down to convince his 'good men and women', really like Lafayette. But inside, hide the anti-party knife and gun.), \\nPoems say: everyone clean the snow in front of the door, take care of others on the cream;\\nIs not just for more openings, words to the mouth leave half sentence. \\nCentral instructions, to carry out the wind, clear policy, has long been formulated;\\nInternal contradictions are people, welcome the masses, bold criticism. \\nMy class study, has been a whole month, two conferences, hard is serious;\\nSpeak, ideological struggle, three major, resolutely clear! \\nParty member privileges, everyone admits, no longer knocks down, woe the nation! \\nWho knows last night, increased contradiction, one appeared, Ting Ming Luojun;\\nGo to the podium, a burst of thunder, hairy self-recommendation, high talk;\\nA defense lawyer, hat company, a number of jobs, is really scary;\\nThree points of analysis, two reasons, what, etc., unknown truth:\\nI am the regiment committee, cadres are in the body, the truth of things, I can sound;\\nEr waiting for the people, can not mess, if there is no respect, beware of caution! \\nAnti-revolutionary crime, added to the body, otherwise, the people of Taiwan! \\nLuo Jun's words, not talk, internal contradictions are regarded as hostile,\\nIt is not upside down, black and white. Advise the Jun, fire candles be careful! \\nI Ben E meishanheshang idle, unintentionally passing this door, ears to hear very much debate, no longer stained red dust, so a section of persuasion, for good men and women. (6.11. Published in a blackboard newspaper)"}
        ],
        "workplaceCombined": "Student at Department of History, Yunnan University",
        "fullName": "E Meishanheshang"
    },
    "E5": {
        "rightistId": "E5",
        "contributorId": "",
        "lastUpdatedAt": "2022-07-26T18:18:57",
        "profileImageId": "",
        "imageId": [],
        "source": "original",
        "status": "Unknown",
        "initial": "E",
        "firstName": "Yicheng",
        "lastName": "E",
        "gender": "",
        "birthYear": 0,
        "deathYear": 0,
        "rightistYear": 0,
        "ethnicity": 0,
        "birthplace": "",
        "education": "",
        "job": "Engineer",
        "detailJob": "Engineer",
        "workplace": "Third Design Institute (Tianjin)",
        "reference": "Excerpt from the General Office of the Central Committee of the Communist Party of China: Situation Briefing (Wind Album), Compilation (12), 1957.8.12",
        "description": "E E yicheng, Engineer, Third Design Institute (Tianjin), Ministry of Railways\n",
        "events": [
            {"startYear": 1957.0, "endYear": 0, "event": "he was beaten as a 'member of the Kuomintang who used to be the Chief of General Affairs of the Railway and Chief of Police'. According to a report by Li Jun, Office of the Communist Party of China's Tianjin Municipal Committee, to the Central Office of the Communist Party of China (CPC): In two state-run and local state-owned industrial systems, 21 small groups were revealed, including five of the Third Design Institute of the Ministry of Railways; a recently discovered small group consisting of 10 people, with four backbone elements, six The outsider masses, these backbone elements are Ee E yicheng (engineer, KMT member, former railway chief and police officer), Director of Services), Wu Dafu, Ma Pei-mo (Engineer), and Zhang Jinfu (Technician). When Zhang Jin was found to be rich in problems, Wu Dafu also rose up to deal with the following problems: they talked in the research room house, openly to let Zhang Mingfang, said: the design institute is the world of the party, political leadership can not have technology, and the world crows are generally black, and the Communist Party and the Kuomintang are the same. They also plan to replace the party leader of the Union Advocacy Group of the Institute. There is another small group of eight people in the hospital, which originally only knew two people. They posted a large print of 'whistling the rain' in the ring, saying: 'The party is on the beam is not right down the beam, put down the slaughter into the Buddha.'"}
        ],
        "memoirs": [],
        "workplaceCombined": "Engineer at Third Design Institute (Tianjin)",
        "fullName": "E Yicheng"
    },
    "E6": {
        "rightistId": "E6",
        "contributorId": "",
        "lastUpdatedAt": "2022-07-26T18:18:57",
        "profileImageId": "",
        "imageId": [],
        "source": "original",
        "status": "Unknown",
        "initial": "E",
        "firstName": "Zheng",
        "lastName": "E",
        "gender": "",
        "birthYear": 0,
        "deathYear": 0,
        "rightistYear": 0,
        "ethnicity": 0,
        "birthplace": "",
        "education": "",
        "job": "Faculty",
        "detailJob": "Faculty",
        "workplace": "the First Military Medical University",
        "reference": "Excerpt from Jilin Provincial Committee of the Communist Party of China's Jilin Provincial Committee: 'List of right-wing elements from all walks of life in Jilin Province 1958', Liu Dawei, Li Xuyin: 'The First Military Medical University deepened anti-right struggle, exposes Li natural and other right-wing elements', the General Political Ministry: 'First Military Medical University exposes small opposition groups'",
        "description": "E E zheng, faculty member of the First Military Medical University\n",
        "events": [
            {"startYear": 1957.0, "endYear": 0, "event": "he was accused of 'anti-party activities' with Li Zizun, Gao Jie, Yang Gui-zhen, Li Zhuojun, etc., and became members of 'small opposition groups' and right-wing elements."}
        ],
        "memoirs": [],
        "workplaceCombined": "Faculty at the First Military Medical University",
        "fullName": "E Zheng"
    }
}